In [1]:
# series --> 1D + index (list like, dict like)
# DataFrame --> 2D +index 
# index --> list like, set like

In [3]:
import pandas as pd
import numpy as np

In [4]:
df_skaters = pd.read_csv("speed_skaters.csv")
df_skaters.head()

                    Name  Birth year  Height  Weight
0  Aerchenghazi XIAKAINI        1995    1.85      83
1      Aleksandr LEBEDEV        1987    1.78      70
2       Aleksandr ZHIGIN        1986    1.80      80
3        Aleksey SUVOROV        1991    1.80      80
4          Aleksey YESIN        1987    1.78      85

In [6]:
df_2006 = pd.read_csv("mens1500_2006.csv")
df_2010 = pd.read_csv("mens1500_2010.csv")
df_2014 = pd.read_csv("mens1500_2014.csv")
df_2018 = pd.read_csv("mens1500_2018.csv")
df_2018.head()

   Rank         Athlete Country    Result  Finished  Year
0   1.0      Kjeld NUIS     NED  01:44.01         1  2018
1   2.0   Patrick ROEST     NED  01:44.86         1  2018
2   3.0    Min Seok KIM     KOR  01:44.93         1  2018
3   4.0  Haralds SILOVS     LAT  01:45.25         1  2018
4   5.0      Takuro ODA     JPN  01:45.44         1  2018

In [7]:
name = df_skaters["Name"]

In [8]:
name.iloc[2]

'Aleksandr ZHIGIN'

In [9]:
df_results = pd.concat([df_2006, df_2010, df_2014, df_2018])

In [10]:
len(df_results)

153

In [11]:
df_results = df_results.reset_index(drop=True)
df_results.tail()

     Rank                Athlete Country    Result  Finished  Year
148  31.0      Benjamin DONNELLY     CAN  01:49.68         1  2018
149  32.0  Aerchenghazi XIAKAINI     CHN  01:50.16         1  2018
150  33.0            Marten LIIV     EST  01:50.23         1  2018
151  34.0            William TAI     TPE  01:50.63         1  2018
152   NaN   Allan Dahl JOHANSSON     NOR       NaN         0  2018

In [12]:
df = pd.merge(df_skaters, df_results, left_on="Name", right_on="Athlete", how="inner").drop(["Athlete"], axis=1)
df.head()

,Name,Birth year,Height,Weight,Rank,Country,Result,Finished,Year
0,Aerchenghazi XIAKAINI,1995,1.85,83,32.0,CHN,01:50.16,1,2018
1,Aleksandr LEBEDEV,1987,1.78,70,36.0,RUS,01:52.09,1,2010
2,Aleksandr ZHIGIN,1986,1.80,80,34.0,KAZ,01:49.48,1,2014
3,Aleksey SUVOROV,1991,1.80,80,25.0,RUS,01:48.11,1,2014
4,Aleksey YESIN,1987,1.78,85,21.0,RUS,01:48.65,1,2010

In [13]:
df[["Name", "Country", "Result", "Year"]].head()

                    Name Country    Result  Year
0  Aerchenghazi XIAKAINI     CHN  01:50.16  2018
1      Aleksandr LEBEDEV     RUS  01:52.09  2010
2       Aleksandr ZHIGIN     KAZ  01:49.48  2014
3        Aleksey SUVOROV     RUS  01:48.11  2014
4          Aleksey YESIN     RUS  01:48.65  2010

In [14]:
name = df["Name"]
name.head()

0    Aerchenghazi XIAKAINI
1        Aleksandr LEBEDEV
2         Aleksandr ZHIGIN
3          Aleksey SUVOROV
4            Aleksey YESIN
Name: Name, dtype: object

In [15]:
c_names = name[name.str.contains("c")]

In [16]:
df[(df["Birth year"] > 1990) & (df["Rank"] <= 10)] # top 10 finishers born after 1990

,Name,Birth year,Height,Weight,Rank,Country,Result,Finished,Year
9,Bart SWINGS,1991,1.78,67,10.0,BEL,01:45.95,1,2014
10,Bart SWINGS,1991,1.78,67,6.0,BEL,01:45.49,1,2018
62,Sindre HENRIKSEN,1992,1.90,82,7.0,NOR,01:45.64,1,2018
67,Min Seok KIM,1999,1.78,68,3.0,KOR,01:44.93,1,2018
100,Takuro ODA,1992,1.78,75,5.0,JPN,01:45.44,1,2018
102,Sverre Lunde PEDERSEN,1992,1.80,73,8.0,NOR,01:45.66,1,2014
103,Sverre Lunde PEDERSEN,1992,1.80,73,9.0,NOR,01:46.12,1,2018
104,Patrick ROEST,1995,1.87,78,2.0,NED,01:44.86,1,2018
128,Shane WILLIAMSON,1995,1.76,67,10.0,JPN,01:46.21,1,2018

In [ ]:
df[["Rank"] == 1]

In [ ]:
def parse_time(time):
    if time == time:
        parts = time.split(":")
        return int(parts[0]*60 + float(parts[1]))
    else: 
        return time 

df["Float_result"] = df["Result"].apply(parse_time)

In [19]:
nan = float("NaN")
nan = nan